{
    "arduino": [
        {
            "nome": "Botão de reinicialização",
            "descricao": "Botão que reinicia a placa.",
            "imagem": "ImagensArduino/img1.png"
            
        },
        {
            "nome": "Conector USB",
            "descricao": "Conecta a placa ao computador. É por onde o computador e o Arduino se comunicam com o auxílio de um cabo USB, além de ser uma opção de alimentação da placa.",
            "imagem": "ImagensArduino/img2.png"
        },
        {
            "nome": "Conversor Serial-USB e LEDs TX/RX",
            "descricao": "Para que o computador e o microcontrolador conversem, é necessário que exista um chip que traduza as informações vindas de um para o outro. Os LEDs TX e RX acendem quando o Arduino está transmitindo e recebendo dados pela porta serial respectivamente.",
            "imagem": "ImagensArduino/img3.png"
        },
        {
            "nome": "Cristal Oscilador",
            "descricao": "O Cristal Oscilador 16MHz é responsável por estabelecer a sincronia de tempo (clock) de um microcontrolador.",
            "imagem": "ImagensArduino/img4.png"
        },
        {
            "nome": "Regulador de tensão",
            "descricao": "Mantém a tensão de alimentação do dispositivo dentro de limites específicos.",
            "imagem": "ImagensArduino/img12.png"
        },
        {
            "nome": "Conector de Alimentação",
            "descricao": "Responsável por receber a energia de alimentação externa, que pode ter uma tensão de no mínimo 7 Volts e no máximo 20 Volts e uma corrente mínima de 300mA. Recomendamos 9V, com um pino redondo de 2,1mm e centro positivo. Caso a placa também esteja sendo alimentada pelo cabo USB, ele dará preferência à fonte externa automaticamente.",
            "imagem": "ImagensArduino/img5.png"
        },
        {
            "nome": "Pinos digitais de entrada e saída",
            "descricao": "Pinos que podem ser programados para agirem como entradas ou saídas fazendo com que o Arduino interaja com o meio externo.",
            "imagem": "ImagensArduino/img10.png"
        },
        {
            "nome": "LED de Alimentação",
            "descricao": "Indica se a placa está energizada por meio de um LED.",
            "imagem": "ImagensArduino/img9.png"
        },
        {
            "nome": "Porta ICSP",
            "descricao": "Interface de programação para o microcontrolador.",
            "imagem": "ImagensArduino/img8.png"
        },
        {
            "nome": "Microcontrolador ATmega 328",
            "descricao": "Esse é o cérebro do Arduino. Um computador inteiro dentro de um pequeno chip. Este é o dispositivo programável que roda o código que enviamos à placa.",
            "imagem": "ImagensArduino/img11.png"
        },
        {
            "nome": "Pinos analógicos",
            "descricao": "Pinos que podem ser usados para medir sinais analógicos.",
            "imagem": "ImagensArduino/mg7.png"
        },
        {
            "nome": "Pinos de alimentação",
            "descricao": "Fornecem diversos valores de tensão que podem ser utilizados para energizar os componentes do seu projeto. Devem ser usados com cuidado, para que não sejam forçados a fornecer valores de corrente superiores ao suportado pela placa.",
            "imagem": "ImagensArduino/img6.png"
        }
    ]
}
